Demp.SimpleSoapService/bin/Data/DM/getPreparation/Req/METH66.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:biz="http://biz.dms.pms.model.ha.org.hk/">
   <soapenv:Header/>
   <soapenv:Body>
      <biz:getPreparation>
         <arg0>
            <dispHospCode></dispHospCode>
            <dispWorkstore></dispWorkstore>
            <itemCode>METH66</itemCode>
            <trueDisplayname>METHYLPREDNISOLONE</trueDisplayname>
            <formCode>OIN</formCode>
            <saltProperty>ACEPONATE</saltProperty>
            <drugScope>I</drugScope>
            <specialtyType>I</specialtyType>
            <pasSpecialty></pasSpecialty>
            <pasSubSpecialty></pasSubSpecialty>
            <costIncluded>true</costIncluded>
            <hqFlag>true</hqFlag>
         </arg0>
      </biz:getPreparation>
   </soapenv:Body>
</soapenv:Envelope>